# Luke Riechert
## Week13 11/17/2020
### Python - Pandas Datafrme Processing

In [1]:
import numpy as np

from pandas import Series,DataFrame
import pandas as pd

In [2]:
#Drop entries
df = DataFrame(np.arange(16).reshape((4,4)), index=['OH', 'CO', 'UT', 'NY'],
              columns=['one', 'two', 'three', 'four'])
df

    one  two  three  four
OH    0    1      2     3
CO    4    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [3]:
df.values

array([[ 0,  1,  2,  3],
       [ 4,  5,  6,  7],
       [ 8,  9, 10, 11],
       [12, 13, 14, 15]])

In [4]:
df.drop(['CO'])

    one  two  three  four
OH    0    1      2     3
UT    8    9     10    11
NY   12   13     14    15

In [5]:
df

    one  two  three  four
OH    0    1      2     3
CO    4    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [6]:
df.drop(['CO','OH'])

    one  two  three  four
UT    8    9     10    11
NY   12   13     14    15

In [9]:
df.drop('two',axis=1)

    one  three  four
OH    0      2     3
CO    4      6     7
UT    8     10    11
NY   12     14    15

In [8]:
df.drop(['two','four'],axis=1)

    one  three
OH    0      2
CO    4      6
UT    8     10
NY   12     14

In [10]:
df.drop('two',axis='columns')

    one  three  four
OH    0      2     3
CO    4      6     7
UT    8     10    11
NY   12     14    15

In [11]:
df

    one  two  three  four
OH    0    1      2     3
CO    4    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [12]:
df.drop('two',inplace=True, axis='columns')
df

    one  three  four
OH    0      2     3
CO    4      6     7
UT    8     10    11
NY   12     14    15

In [13]:
#select entries
df = DataFrame(np.arange(16).reshape((4,4)), index=['OH', 'CO', 'UT', 'NY'],
              columns=['one', 'two', 'three', 'four'])
df

    one  two  three  four
OH    0    1      2     3
CO    4    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [14]:
df['one']

OH     0
CO     4
UT     8
NY    12
Name: one, dtype: int32

In [15]:
df[['one','four']]

    one  four
OH    0     3
CO    4     7
UT    8    11
NY   12    15

In [16]:
df[:2]

    one  two  three  four
OH    0    1      2     3
CO    4    5      6     7

In [17]:
df[df['three']>5]

    one  two  three  four
CO    4    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [18]:
df>5

      one    two  three   four
OH  False  False  False  False
CO  False  False   True   True
UT   True   True   True   True
NY   True   True   True   True

In [19]:
df[df<5] = 0
df

    one  two  three  four
OH    0    0      0     0
CO    0    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [21]:
#select entries with loc and iloc
df.loc['CO']

one      0
two      5
three    6
four     7
Name: CO, dtype: int32

In [23]:
df.loc['CO', ['two','four']]

two     5
four    7
Name: CO, dtype: int32

In [24]:
df

    one  two  three  four
OH    0    0      0     0
CO    0    5      6     7
UT    8    9     10    11
NY   12   13     14    15

In [25]:
df.iloc[2]

one       8
two       9
three    10
four     11
Name: UT, dtype: int32

In [26]:
df.iloc[2, [3,0,1]]

four    11
one      8
two      9
Name: UT, dtype: int32

In [27]:
df.iloc[[1,2], [3,0,1]]

    four  one  two
CO     7    0    5
UT    11    8    9

In [29]:
#Arthmetic and alignment of data
df1 = DataFrame(np.arange(9).reshape((3,3)), columns=list('bcd'), 
                index=['Ohio', 'Texas', 'Colorado'])

df2 = DataFrame(np.arange(12).reshape((4,3)), columns=list('bde'), 
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])

df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [30]:
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [31]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [32]:
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0   NaN
Ohio      3.0  1.0   6.0   5.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0   8.0
Utah      0.0  NaN   1.0   2.0

In [33]:
df1

          b  c  d
Ohio      0  1  2
Texas     3  4  5
Colorado  6  7  8

In [34]:
df1['e'] = df1['b'] + df1['d']

In [35]:
df1

          b  c  d   e
Ohio      0  1  2   2
Texas     3  4  5   8
Colorado  6  7  8  14

In [36]:
df1.add(df2,fill_value=0)

            b    c     d     e
Colorado  6.0  7.0   8.0  14.0
Ohio      3.0  1.0   6.0   7.0
Oregon    9.0  NaN  10.0  11.0
Texas     9.0  4.0  12.0  16.0
Utah      0.0  NaN   1.0   2.0

In [37]:
#Operation between DataFrame and Series
df2

        b   d   e
Utah    0   1   2
Ohio    3   4   5
Texas   6   7   8
Oregon  9  10  11

In [38]:
s = df2.iloc[0]
s

b    0
d    1
e    2
Name: Utah, dtype: int32

In [39]:
df2 - s

        b  d  e
Utah    0  0  0
Ohio    3  3  3
Texas   6  6  6
Oregon  9  9  9

In [40]:
# sort and rank
df3 = DataFrame(np.arange(8).reshape(2,4), columns=list('dabc'),
               index=['three','one'])

df3

       d  a  b  c
three  0  1  2  3
one    4  5  6  7

In [41]:
df3.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [42]:
df3.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [43]:
df3.sort_index(axis=1,ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [45]:
df4 = DataFrame({'b': [4,7,-3,2], 'a':[0,1,0,1]})
df4

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [46]:
df4.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [47]:
df4.sort_values(by=['a','b'])

   b  a
2 -3  0
0  4  0
3  2  1
1  7  1

In [48]:
df4

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [49]:
df5 = DataFrame({'b': [14,17,-13,12], 'a':[10,11,10,11]})
df5

    b   a
0  14  10
1  17  11
2 -13  10
3  12  11

In [50]:
df5.rank()

     b    a
0  3.0  1.5
1  4.0  3.5
2  1.0  1.5
3  2.0  3.5